package com.ftkj.manager.active.base;

/**
 * 活动枚举
 * @author Jay
 * @time:2017年9月8日 下午2:25:42
 */
public enum EAtv {
	活动入口屏蔽(0),
	成长基金福利(1),
	首冲送礼包(2),
	八天登录福利(3),
	首冲双倍(4),
	
//	装备强化周卡(5),
//	装备经验月卡(6),
//	头像碎片周卡(7),
//	球星卡经验月卡(8),
//	荣耀点月卡(9),
	//
	每日充值特惠(10),
	
	巨星之路_球队等级(11),
	巨星之路_主线赛程(12),
	巨星之路_装备强化(13),
//	巨星之路_装备升级(14),
	巨星之路_装备进阶(15),
//	巨星之路_球星卡星级(16),
//	巨星之路_球星卡品质(17),
	巨星之路_全队攻防(18),
	巨星之路_球队工资(19),
	巨星之路_累计充值(20),
	//
	巨星之路_球员等级(23),
	巨星之路_球员星级(24),
	//
	CDKey活动(25),
	//
//	经验手册月卡(21),
//	训练点月卡(22),
	
	// 2018新年活动
	彩球大战(30),
	指定天登录领奖(31),
	每天在线领奖活动(32),
	累计充值天数领奖(33),
	累计充值球券领奖(34),
	福袋_累计充值后购买(35),
	做任务赢字牌兑奖(36),
	步步高升奖池抽奖(37),
	//
	竞猜(38),
	球星挑战(39),
	主线赛程通关送球员(40),
	
	// 公测活动
	公测_累计登录礼包(41),
	公测_天梯赛PK之王(42),
	公测_抽奖狂欢(43),
	公测_折扣礼包(44),
	公测_最佳经理(45),
	
	//
	季后赛总冠军活动(51),
	经理培训班(52),
	节日礼包(53),
	
	//
	端午活动_登录得积分(54),
	端午活动_单笔充值得积分(55),
	端午活动_比赛得积分(56),
	端午活动_招募得积分(57),
	
	新秀活动_竞技赛(58),
	
	答题活动(59),

	
	// 长期活动，尽量用大ID段来控制
	恢复精力活动(901),
	等级礼包(902),
	充值统计(1001),
	消费统计(1002),
	
	极限挑战(59),
	;
	protected int atvId;
	
	private EAtv(int atvId) {
		this.atvId = atvId;
	}
	
	public int getAtvId() {
		return this.atvId;
	}
}
